In [1]:
#Use df.loc[] and df.iloc[] to select only rows, only columns or both.
#Use df.at[] and df.iat[] to access a single value by row and column.
#First index selects rows, second index columns.
import pandas as pd

In [26]:
df = pd.DataFrame(
{"a" : [1, 2,  3,  4,  5, 6],
"b" :  [7, 8,  9,  10,  11, 12],
"c" : [12, 14,  15,  16,  17, 18]
},
index = [1, 2, 3,4,5,6])
display(df)

   a   b   c
1  1   7  12
2  2   8  14
3  3   9  15
4  4  10  16
5  5  11  17
6  6  12  18

In [17]:
#Select rows 1-3.
df.iloc[0:3]

   a  b  c
1  4  4  4
2  5  5  5
3  6  6  6

In [18]:
#Select columns in positions 1, 2 and 5 (first column is 0).
df.iloc[:, [0, 2]]

    a   c
1   4   4
2   5   5
3   6   6
4  10  10
5  11  11
6  12  12

In [20]:
#Select all columns between x2 and x4 (inclusive).
df.loc[:, 'x0':'x2']

Empty DataFrame
Columns: []
Index: [1, 2, 3, 4, 5, 6]

In [22]:
#Select rows meeting logical condition, and only the specific columns.
df.loc[df['a'] > 10, ['a', 'c']]

    a   c
5  11  11
6  12  12

In [23]:
#Access single value by index
df.iat[1, 2]

5

In [27]:
#Access single value by label
df.at[4, 'a']

4